{
    "GameName": "Flotzzy, by Dustin LLC",
    "Settings": {
        "GamerTag": "Your unique identifier for the game. It's used to personalize your settings and track your progress.",
        "Persistent Score": "Keeps track of your highest score over time. If you use the same GamerTag, your score will follow you wherever you play the game.",
        "Timer": "When enabled, this setting runs a timer and saves your best time along with your highest score. If disabled, no time will be recorded for high scores.",
        "Rounds": "Determines the number of rounds before the game ends.",
        "Number of Players": "Options include 1, 2, 4, 6, or 8 players. Currently, only single-player mode is implemented; other options will be disabled until multiplayer is fully developed."
    },
    "Rules": {
        "Dice": "The game uses 6 dice in total. One die has six numbered sides (1-6), represented by dots or 'pips'. On this die, opposite sides always sum to 7 (e.g., 1 is opposite 6, 2 is opposite 5, etc.). This die is rolled first on each turn to determine how many pips the player needs to score a point. Rolling a 1-5 sets that as the target, while a 6 is wild, allowing the player to choose any number from 1-5 as their target. The other 5 dice are blank on 5 sides, with only the '1' side showing a pip. These dice are rolled to try and match the number shown on the first die.",
        "Rolling the Dice": "On each turn, the player first rolls the numbered die. The result (1-5) determines how many pips they need to score a point. If a 6 is rolled, the player can choose any number from 1-5 as their target. Next, the player rolls all five single-pip dice. Any dice showing a pip are set aside, and the remaining dice are re-rolled. This continues until either the round ends or the player achieves their target number of pips to score a point. Once a point is scored, the round ends immediately, even if more rolls were available. Only one point can be scored per round.",
        "How to Win": "In multiplayer mode (not currently available), the player with the most points after the set number of rounds wins. In single-player mode, the goal is to beat the clock or achieve the best score associated with your GamerTag."
    }
}